<?php

namespace App\Controllers;

class Japanese extends BaseController
{

    private function retrieveCharacters(array $types): array
    {
        $characters = [
            'hiragana' => [
                'a'  =>  ['a'   => 'あ', 'i' => 'い', 'u' => 'う', 'e' => 'え', 'o' => 'お'],
                'ka' =>  ['ka'  => 'か', 'ki' => 'き', 'ku' => 'く', 'ke' => 'け', 'ko' => 'こ'],
                'sa' =>  ['sa'  => 'さ', 'shi' => 'し', 'su' => 'す', 'se' => 'せ', 'so' => 'そ'],
                'ta' =>  ['ta'  => 'た', 'chi' => 'ち', 'tsu' => 'つ', 'te' => 'て', 'to' => 'と'],
                'na' =>  ['na'  => 'な', 'ni' => 'に', 'nu' => 'ぬ', 'ne' => 'ね', 'no' => 'の'],
                'ha' =>  ['ha'  => 'は', 'hi' => 'ひ', 'fu' => 'ふ', 'he' => 'へ', 'ho' => 'ほ'],
                'ma' =>  ['ma'  => 'ま', 'mi' => 'み', 'mu' => 'む', 'me' => 'め', 'mo' => 'も'],
                'ya' =>  ['ya'  => 'や', 'yu' => 'ゆ', 'yo' => 'よ'],
                'ra' =>  ['ra'  => 'ら', 'ri' => 'り', 'ru' => 'る', 're' => 'れ', 'ro' => 'ろ'],
                'wa' =>  ['wa'  => 'わ', 'wo' => 'を'],
                'n'  =>  ['n'   => 'ん'],
                'ga' =>  ['ga'  => 'が', 'gi' => 'ぎ', 'gu' => 'ぐ', 'ge' => 'げ', 'go' => 'ご'],
                'za' =>  ['za'  => 'ざ', 'ji' => 'じ', 'zu' => 'ず', 'ze' => 'ぜ', 'zo' => 'ぞ'],
                'da' =>  ['da'  => 'だ', 'ji' => 'ぢ', 'zu' => 'づ', 'de' => 'で', 'do' => 'ど'],
                'ba' =>  ['ba'  => 'ば', 'bi' => 'び', 'bu' => 'ぶ', 'be' => 'べ', 'bo' => 'ぼ'],
                'pa' =>  ['pa'  => 'ぱ', 'pi' => 'ぴ', 'pu' => 'ぷ', 'pe' => 'ぺ', 'po' => 'ぽ'],
                'kya' => ['kya' => 'きゃ', 'kyu' => 'きゅ', 'kyo' => 'きょ'],
                'sha' => ['sha' => 'しゃ', 'shu' => 'しゅ', 'sho' => 'しょ'],
                'cha' => ['cha' => 'ちゃ', 'chu' => 'ちゅ', 'cho' => 'ちょ'],
                'nya' => ['nya' => 'にゃ', 'nyu' => 'にゅ', 'nyo' => 'にょ'],
                'hya' => ['hya' => 'ひゃ', 'hyu' => 'ひゅ', 'hyo' => 'ひょ'],
                'mya' => ['mya' => 'みゃ', 'myu' => 'みゅ', 'myo' => 'みょ'],
                'rya' => ['rya' => 'りゃ', 'ryu' => 'りゅ', 'ryo' => 'りょ'],
                'gya' => ['gya' => 'ぎゃ', 'gyu' => 'ぎゅ', 'gyo' => 'ぎょ'],
                'ja'  => ['ja'  => 'じゃ', 'ju'  => 'じゅ', 'jo'  => 'じょ'],
                'bya' => ['bya' => 'びゃ', 'byu' => 'びゅ', 'byo' => 'びょ'],
                'pya' => ['pya' => 'ぴゃ', 'pyu' => 'ぴゅ', 'pyo' => 'ぴょ'],
            ],
            'katakana' => [
                'a'  =>  ['a'   => 'ア', 'i' => 'イ', 'u' => 'ウ', 'e' => 'エ', 'o' => 'オ'],
                'ka' =>  ['ka'  => 'カ', 'ki' => 'キ', 'ku' => 'ク', 'ke' => 'ケ', 'ko' => 'コ'],
                'sa' =>  ['sa'  => 'サ', 'shi' => 'シ', 'su' => 'ス', 'se' => 'セ', 'so' => 'ソ'],
                'ta' =>  ['ta'  => 'タ', 'chi' => 'チ', 'tsu' => 'ツ', 'te' => 'テ', 'to' => 'ト'],
                'na' =>  ['na'  => 'ナ', 'ni' => 'ニ', 'nu' => 'ヌ', 'ne' => 'ネ', 'no' => 'ノ'],
                'ha' =>  ['ha'  => 'ハ', 'hi' => 'ヒ', 'fu' => 'フ', 'he' => 'ヘ', 'ho' => 'ホ'],
                'ma' =>  ['ma'  => 'マ', 'mi' => 'ミ', 'mu' => 'ム', 'me' => 'メ', 'mo' => 'モ'],
                'ya' =>  ['ya'  => 'ヤ', 'yu' => 'ユ', 'yo' => 'ヨ'],
                'ra' =>  ['ra'  => 'ラ', 'ri' => 'リ', 'ru' => 'ル', 're' => 'レ', 'ro' => 'ロ'],
                'wa' =>  ['wa'  => 'ワ', 'wo' => 'ヲ'],
                'n'  =>  ['n'   => 'ン'],
                'ga' =>  ['ga'  => 'ガ', 'gi' => 'ギ', 'gu' => 'グ', 'ge' => 'ゲ', 'go' => 'ゴ'],
                'za' =>  ['za'  => 'ザ', 'ji' => 'ジ', 'zu' => 'ズ', 'ze' => 'ゼ', 'zo' => 'ゾ'],
                'da' =>  ['da'  => 'ダ', 'ji' => 'ヂ', 'zu' => 'ジ', 'de' => 'デ', 'do' => 'ド'],
                'ba' =>  ['ba'  => 'バ', 'bi' => 'ビ', 'bu' => 'ブ', 'be' => 'ベ', 'bo' => 'ボ'],
                'pa' =>  ['pa'  => 'パ', 'pi' => 'ピ', 'pu' => 'プ', 'pe' => 'ペ', 'po' => 'ポ'],
                'kya' => ['kya' => 'キャ', 'kyu' => 'キュ', 'kyo' => 'キョ'],
                'sha' => ['sha' => 'シャ', 'shu' => 'シュ', 'sho' => 'ショ'],
                'cha' => ['cha' => 'チャ', 'chu' => 'チュ', 'cho' => 'チョ'],
                'nya' => ['nya' => 'ニャ', 'nyu' => 'ニュ', 'nyo' => 'ニョ'],
                'hya' => ['hya' => 'ヒャ', 'hyu' => 'ヒュ', 'hyo' => 'ヒョ'],
                'mya' => ['mya' => 'ミャ', 'myu' => 'ミュ', 'myo' => 'ミョ'],
                'rya' => ['rya' => 'リャ', 'ryu' => 'リュ', 'ryo' => 'リョ'],
                'gya' => ['gya' => 'ギャ', 'gyu' => 'ギュ', 'gyo' => 'ギョ'],
                'ja'  => ['ja'  => 'ジャ', 'ju'  => 'ジュ', 'jo'  => 'ジョ'],
                'bya' => ['bya' => 'ビャ', 'byu' => 'ビュ', 'byo' => 'ビョ'],
                'pya' => ['pya' => 'ピャ', 'pyu' => 'ピュ', 'pyo' => 'ピョ'],
            ]
        ];
        $result_set = [];
        foreach ($types as $type) {
            $result_set[$type] = $characters[$type];
        }
        return $result_set;
    }

    public function index(): string
    {
        $characters = $this->retrieveCharacters(['hiragana', 'katakana']);
        return '<pre>' . print_r($characters, true) . '</pre>';
    }

}